{
	"WBUI2":
	{
		"settings":
		{
			"openbutton": 0,
			"hideicon": false,
			"hideiconafter": 60,
			"iconurl": "https://i.imgur.com/CC6xlAT.png",
			"disableicontext": true,
			"iconposition": 2,
			"icontextcolor": 0,
			"openonstart": true,
			"openonstartonlynewplayers": false,
			"updateinterval": 12
		},
		"tabs": [
			{
				"layout": 1,
				"buttontext": "Welcome",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "Welcome to Gamers Den – The Ultimate Vanilla+ ARK Experience",
						"text": "Gamers Den offers a balanced ARK experience designed to safe guard your progression while preserving the core survival gameplay that makes ARK rewarding. With moderately boosted rates, enhanced breeding, quality-of-life features and increased structure decay timers, you can be assured that your time committed to ARK is respected and preserved for the long haul!\r\n\r\n-=BUILT FOR EVERY PLAYSTYLE=-\r\nWhether you’re a solo player, part of a long-term tribe, or a returning survivor, Gamers Den supports casual and dedicated players alike. PvE is the foundation of the cluster, with optional Tribe War available for players who want consensual PvP without forcing conflict on others.\r\n\r\n-=PRIVATELY OWNED • COMMUNITY FOCUSED • NO WIPES=-\r\nGamers Den is a privately owned and operated server that focuses on long-term stability and redundant safety measures to protect your progress. This is a no-wipe cluster that offers all the core maps plus the most popular ones by the modding community. Whether you’re grinding the old-fashioned way or taking advantage of server quality-of-life features, Gamers Den is built to keep the experience stable, fair, and respectful for everyone.\r\n\r\n-=Read the Rules!=-"
					}
				]
			},
			{
				"layout": 1,
				"buttontext": "Updates",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "Gamers Den Cluster Updates:",
						"text": "Any significant server changes, updates, or modifications will be posted here.\r\nStay tuned to keep up with adjustments to gameplay, settings, or features that may impact your experience."
					},
					{
						"title": "JSON settings:",
						"text": "OpenButton  -  0/1/2/3/4/5/6, default:0, 0=F1, 1=F2, 2=F3, 3=F4, 4=F5, 5=Delete, 6=Home  -  Determines the button the player needs to press to open the UI.\n\nHideIcon  -  true/false, default: false  -  If true the Icon in the bottom left corner vanishes after some time.\n\nHideIconAfter  -  integer, default: 60  -  Determines after how many seconds the Icon vanishes.\n\nIconURL  -  \"URL\", default: \"https://i.imgur.com/OZ6xOjY.png\"  -  You can upload a custom image somewhere (e.g. imgur, link down below) and it will be used as the Icon in the bottom left.\n\nDisableIconText  -  true/false, default:false  -  If true the text \"F1 for Info\" will not be displayed.\n\nIconPosition  -  0/1/2/3, default:0, 0=Top Left, 1=Top Right, 2=Bottom Right, 3=Bottom Left  -  Set the position of the Icon.\n\nIconTextColor  -  0/1/2/3/4/5/6/7/8, default:0, 0=Light Blue, 1=Red, 2=Green, 3=Blue, 4=Yellow, 5=Orange, 6=Violet, 7=Black, 8=White  -  Sets the color of the \"F1 For Info\" text.\n\nOpenOnStart  -  true/false, default: true  -  If true the UI will open automatically after the player spawned.\n\nOpenOnStartOnlyNewPlayers  -  true/false, default: true  -  If true the UI only opens automatically the first time the player spawns on the server.\n\nUpdateInterval  -  integer, default: 12  -  This value determines the time in hours the mod automatically pulls the JSON from the URL to update settings.\n\nGENERAL INFORMATION:\n\n\nFor the rest of the settings pls checkout the Wiki or the example JSON linked down below.\n\nIn order to pass the JSON-validation you have to use \"*backslash*n\" without a space to generate newlines. although the mod should handle regular newlines just fine.\n\nSpecial characters like \" have to be escaped with a *backslash*\n\nYou can trigger an update of the JSON via console command: \"cheat scriptcommand WBUI2 update\"\n\nBe careful with the file size of the images. The user have to download the images."
					}
				]
			},
			{
				"layout": 2,
				"buttontext": "Rules",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "Building Rules – Gamers Den",
						"text": "All violations are subject to warnings or immediate bans depending on severity.\r\n\r\nBase Limit\r\n* Each tribe is allowed 2 bases per map.\r\n* A base is any cluster of structures.\r\n* All structures must be within render distance of each other, \r\n   including any perimeter walls.\r\n* A third base will be removed without warning.\r\n\r\nOpen-World Structures \r\n* Do not spam structures outside your base.\r\n* All taming structures must be removed immediately after use or\r\n  left unlocked for public use.\r\n* Spawn locations must not impact others and are limited to single foundation/bed(s). One per render area - Don’t spam!\r\n* Teleport pads placed outside of your base must be open to public\r\n\r\nNo Meshing\r\n* No structures or turrets may be placed inside the map mesh.\r\n* Slight(max 50% of structure) terrain clipping for aesthetics is allowed\r\n\r\nNo Building or Aggressive Dinos in These Areas:\r\n* Artifact Caves\r\n* Obelisks\r\n* Wyvern Nest / Egg Spawn Zones\r\n* Aberration Surface Entrances\r\n* Extinction “Unfobbable” Location (above King Titan Terminal)\r\n* World Borders (no exploiting foundation placement)\r\n* Spawn Zones (no spawn blocking)\r\n* You may build at Extinction OSDs while active, but must remove all structures afterward.\r\n"
					},
					{
						"title": "Game Rules – Gamers Den",
						"text": "All violations are subject to warnings or immediate bans depending on severity.\r\n\r\nNo Hacking or Exploiting\r\n* Abuse of game, mod, or plugin bugs\r\n* Example: Stacking hundreds of vaults inside each other = exploit.\r\n\r\nOne Character per Player\r\n* Only one character per player per cluster is allowed.\r\n* No second accounts or account sharing.\r\n\r\nNo Aggression at Spawns/Obelisks\r\n* Do not place aggressive dinos or structures at:\r\n* Player spawn zones or Obelisks\r\n\r\nNo Meshing or Map Exploits\r\n*Using the map mesh, terrain glitches, or unintended geometry to gain an advantage is strictly prohibited. This includes hiding bases, dinos, structures, or players inside the mesh.\r\n\r\nNo Insiding\r\n* Stealing from or sabotaging your tribe\r\n* Tribe item replacements will not be issued.\r\n* Choose your tribemates wisely.\r\n\r\nNo Duping or Cheating\r\n* Duplication, glitching, or any form of cheating\r\n\r\nNo Scamming\r\n* All trades must be honest and transparent.\r\n* No scamming other players\r\n\r\nDino Stacking Limit\r\n* Max: 2 dinos stacked inside each other.\r\n* Overstacked dinos will be wiped without notice.\r\n* Separate baby dinos once they mature.\r\n\r\nServer Performance Responsibility\r\n* Tribes must not cause lag or crashes through structure spam excessive breeding\r\n\r\nNo Griefing on PvE Servers\r\n* Intentional destruction or killing of other players’ assets on PvE is strictly forbidden.\r\n\r\nNo Aggressive Dinos on Wander\r\n* Aggressive dinos must be within base walls or “anchored” to a stationary dino at your base.\r\n"
					}
				]
			},
			{
				"layout": 3,
				"buttontext": "Server Specs",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "Gamers Den Server Hardware Overview",
						"text": "Core Specs:\r\n\r\nCPU:\r\n* AMD Ryzen Threadripper 3970X (32 cores / 64 threads) – Built for extreme multitasking and server-grade workloads\r\n\r\nRAM:\r\n* 256GB DDR4 ECC Registered Memory \r\n\r\nStorage:\r\n*4 × 2TB NVMe SSDs in RAID 10 + 256GB NVMe Boot         \r\n* Drive Combines speed and redundancy to keep load times fast and your data safe\r\n\r\nGPU: NVIDIA RTX 3080 \r\n* Supports high-end rendering and server-side GPU acceleration if needed\r\n\r\nMotherboard: TRX40 High-End Workstation Board – Supports advanced thermal regulation, ECC memory, and PCIe 4.0\r\nChassis\tRM41300H01 Optimized for airflow, cable management, and 24/7 operation\r\n\r\nPower Supply: 1000W EPS12V PSU – Enterprise-grade stability and headroom for expansion\r\n"
					},
					{
						"title": "Why It Matters to You",
						"text": "Your gameplay experience depends on server performance – from load times to tick rate, stability, and recovery speed. Our system ensures:\r\n* Low latency\r\n* Minimal server crashes\r\n* Quick map switching\r\n* Room to grow for future expansions or mods"
					},
					{
						"title": "Privately Owned & Community-Driven",
						"text": "If you're curious about performance tuning, cluster setups, or hosting your own server, feel free to reach out  the Gamers Den team is always here to help or geek out with you.\r\n\r\nPlay Hard. Play Smooth. Play Gamers Den.\r\n\r\n"
					}
				]
			},
			{
				"layout": 2,
				"buttontext": "Mods",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "MODS",
						"text": "Cybers Structures QoL+ (Crossplay!)\r\nIntroduces quality-of-life improvements to building structures, such as enhanced snapping, pickup options, and additional building components, facilitating more efficient and creative base construction.\r\n\r\nPelayori's Cryo Storage (Crossplay!)\r\nImplements advanced cryopod storage solutions, allowing players to store and manage their tamed creatures more effectively, reducing clutter and improving server performance.\r\n\r\nSolo Farm Mod\r\nTailored for solo players, this mod enhances resource gathering rates and efficiency, making solo farming more viable and less time-consuming.\r\n\r\nSuper Spyglass Plus\r\nEnhances the in-game spyglass, offering detailed information about creatures, structures, and players, including stats, taming progress, and more."
					},
					{
						"title": "MODS",
						"text": "Shiny! Dinos Ascended\r\nAdds rare, special-colored variants of existing dinosaurs that spawn with unique visual effects and enhanced stats, encouraging exploration and collection.\r\n\r\nGigantoraptor\r\nIntroduces the Gigantoraptor, a new tameable dinosaur with unique abilities and behaviors, adding diversity to the game's fauna.\r\n\r\nDino Color Tokens\r\nIntroduces a system where players can obtain tokens to change the colors of their tamed dinosaurs, enabling customization and personalization of creatures.\r\n\r\nAlfa Oceanic Platforms\r\nSimple and beautiful ocean platforms with low impact on FPS."
					}
				]
			},
			{
				"layout": 3,
				"buttontext": "Server Rates",
				"imageurl": "https://i.imgur.com/KDkvUPa.png",
				"content": [
					{
						"title": "World Settings",
						"text": "*Structure Decay Timer Increased by 4x (64 days on Metal)\r\n*Dino Decay Timer Increased by 3x (24 days)\r\n*Non-Native Creatures Allowed on Aberration\r\n*Cave Flyers Enabled\r\n*Flyer Speed Leveling Enabled\r\n*Player Movement Speed Leveling Enabled\r\n*Dino Stamina Drain Halved\r\n*Always Allow Structure Pickup\r\n*Resource Respawn Timer Halved\r\n*Increased Weight Capacities\r\n*Boosted Loot Qualities\r\n*XP Multiplier 2x\r\n*Harvest Amount 5x\r\n*Dino Spawn Density 2x\r\n*Item Stack Size 50x\r\n*Platform Saddle Limit 100\r\n*Titanosaur Feeding Enabled"
					},
					{
						"title": "Taming & Breeding Settings",
						"text": "*Taming Speed 10×\r\n*Mature Speed 15x\r\n*Incubation Speed 10x\r\n*Imprint Amount 10x\r\n*Mating intervals increased"
					},
					{
						"title": "Max Levels",
						"text": "*Max Wild Dino Level 150\r\n*Max Tek Dino Level 180\r\n*Max Wyvern Level 190\r\n*Max Shiny Level 180"
					}
				]
			},
			{
				"layout": 1,
				"buttontext": "WebStore Information",
				"imageurl": "https://i.imgur.com/7TRdyVT.png",
				"content": [
					{
						"title": "WebStore Link Guide",
						"text": "Step 1 – Log in to the Gamers Den Shop\r\nGo to https://gamersden.serverstore.io/shop\r\n\r\nClick the green Login button in the top-right corner.\r\n\r\nSelect ARK: Survival Ascended from the options.\r\n\r\n\r\nStep 2 – Copy Your Unique Login Command\r\nAfter selecting ARK: Ascended, a VyHub login code will be generated.\r\nCopy the entire command (e.g., /vylogin your-unique-code).\r\n\r\n\r\nStep 3 – Enter the Command In-Game\r\nJoin any Gamers Den ARK Ascended Server.\r\nPress Enter to open the chat box.\r\nPaste the command you copied earlier and hit Enter.\r\n\r\nExample: /vylogin ccdc3be5-d0f6-4075-b79b-0f85c10b5a4e\r\n\r\nYou’ll see a confirmation message if successful.\r\n"
					}
				]
			}
		],
		"links": [
			{
				"text": "WEBSTORE",
				"url": "https://gamesden.tip4serv.com/"
			},
			{
				"text": "DISCORD",
				"url": "https://discord.gg/xsHn2uGV"
			}
		],
		"version": 2
	}
}
